tap "azure/functions"
tap "romkatv/powerlevel10k"

# Shell
brew "zsh"
brew "zsh-completions"
cask "iterm2"

# Development
brew "azure-cli"
cask "azure-data-studio"
brew "azure-functions-core-tools@4"
brew "copilot-cli"
cask "dotnet-sdk"
brew "gh"
brew "git"
cask "microsoft-azure-storage-explorer"
cask "microsoft-remote-desktop"
cask "miro"
brew "node"
cask "postman"
brew "powerlevel10k"
cask "powershell"
cask "rancher"
cask "rider"
cask "visual-studio-code"
cask "whimsical"

# Communication
cask "microsoft-teams"
cask "slack"
cask "logitech-g-hub"

# Applications
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "chatgpt"
cask "elgato-stream-deck"
cask "elgato-control-center"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "onedrive"
cask "messenger"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-word"
cask "nordvpn"
cask "notion"
cask "parallels"
cask "parallels-toolbox"
cask "pdf-expert"
cask "remarkable"
cask "teamviewer"
cask "todoist-app"