tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "azure/functions"
tap "romkatv/powerlevel10k"
tap "isen-ng/dotnet-sdk-versions"

# Shell
brew "zsh"
brew "zsh-completions"
cask "iterm2"

# Development
brew "azure-cli"
cask "azure-data-studio"
brew "azure-functions-core-tools@4"
cask "docker"
cask "dotnet-sdk"
cask "dotnet-sdk6-0-100"
brew "git"
cask "microsoft-azure-storage-explorer"
cask "microsoft-remote-desktop"
cask "postman"
brew "powerlevel10k"
cask "powershell"
cask "rider"
cask "visual-studio-code"
cask "miro"

# Communication
cask "microsoft-teams"
cask "slack"
cask "logitech-g-hub"

# Applications
cask "elgato-stream-deck"
cask "elgato-control-center"
cask "gimp"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "onedrive"
cask "messenger"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-word"
cask "parallels"
cask "parallels-toolbox"
cask "pdf-expert"
cask "remarkable"
cask "teamviewer"
cask "todoist"
